---
kind: type
id: T:Autodesk.Revit.DB.LayoutRuleFixedNumber
source: html/5a2f6d39-0919-d5be-d146-bb985a4ab851.htm
---
# Autodesk.Revit.DB.LayoutRuleFixedNumber

This class indicate the layout rule of a Beam System is Fixed-Number.

## Syntax (C#)
```csharp
public class LayoutRuleFixedNumber : LayoutRule
```

## Remarks
To use this type of LayoutRule, only the number of the beams must be set.